# 4. Пользователь вводит строку из нескольких слов, разделённых пробелами. Вывести каждое
# слово с новой строки. Строки нужно пронумеровать. Если слово длинное, выводить только
# первые 10 букв в слове.

phrase = input('Введите строку: ').split()
for index, item in enumerate(phrase):
    print(index, item[:10])